contiki-os/contiki/cc26xxware/driverlib/aon_wuc.h
//*****************************************************************************
//
//! \brief Control the wake up procedure of the AUX domain.
//!
//! The AUX domain can be woken in two different modes. In both modes power
//! is turned on. In one mode a software event is generated for the AUX
//! controller and it is allowed to start processing. The second mode will
//! just force power on the AUX controller. If CM3 requires exclusive access
//! to the AUX domain resources, it is adviced to ensure that the image in
//! the AUX controller memory is declared invalid. This can be achieved by
//! calling AONWUCAuxImageInvalid().
//!
//! \note Any writes to the AON interface must pass a 32 kHz clock boundary,
//! and is therefore relatively slow. To ensure that a given write is
//! complete the value of the register can be read back after write.
//
//! \note When accessing the AUX domain from the CM3, it is adviced always to
//! have set the AUX in at least \ref AONWUC_AUX_WAKEUP. This overwrites any
//! instruction from the AUX controller and ensures that the AUX domain
//! is on so it won't leave the CM3 hanging.
//!
//! \param ui32Mode is the wake up mode for the AUX domain.
//! - \ref AONWUC_AUX_WAKEUP
//! - \ref AONWUC_AUX_WAKEUP_SWEVT
//! - \ref AONWUC_AUX_ALLOW_SLEEP
//!
//! \return None
//
//*****************************************************************************
extern void AONWUCAuxWakeupEvent(uint32_t ui32Mode);

//*****************************************************************************
//
//! \brief Reset the AUX domain.
//!
//! Use this function to reset the entire AUX domain. The write to the AON_WUC
//! module must pass an 32 kHz clock boundary. By reading the
//! AON_RTC_O_SYNC register after each write, it is guarateed that the AON
//! interface will be in sync and that both the assert and the de-assert of the
//! reset signal to AUX will propagate.
//!
//! \note This requires two writes and two reads on a 32 kHz clock boundary.
//!
//! \return None
//
//*****************************************************************************
extern void AONWUCAuxReset(void);

//*****************************************************************************
//
//! \brief Tells the AUX controller that the image in memory is valid.
//!
//! Use this function to tell the sensor controller that the image in memory is
//! valid, and it is allowed to start executing the program.
//!
//! \return None
//
//*****************************************************************************
__STATIC_INLINE void
AONWUCAuxImageValid(void)
{
    //
    // Tell the AUX controller that the iamge in memory is invalid.
    //
    HWREG(AON_WUC_BASE + AON_WUC_O_AUXCTL) |= AON_WUC_AUXCTL_SCE_RUN_EN;
}

//*****************************************************************************
//
//! \brief Tells the AUX controller that the image in memory is invalid.
//!
//! Use this function to tell the sensor controller that the image in memory is
//! invalid. AUX controller might wake up, but it will stay idle.
//!
//! \return None
//
//*****************************************************************************
__STATIC_INLINE void
AONWUCAuxImageInvalid(void)
{
    //
    // Tell the AUX controller that the iamge in memory is invalid.
    //
    HWREG(AON_WUC_BASE + AON_WUC_O_AUXCTL) &= ~AON_WUC_AUXCTL_SCE_RUN_EN;
}

//*****************************************************************************
//
//! \brief Get the power status of the device.
//!
//! The Always On (AON) domain is the only part of the device which is truly
//! "ALWAYS ON". The power status for the other device can always be read from
//! this status register.
//!
//! Possible power modes for the different parts of the device are:
//!
//! \return Returns the current power status of the device as a bitwise OR'ed
//! combination of these values:
//! - \ref AONWUC_OSC_GBIAS_REQ
//! - \ref AONWUC_AUX_GBIAS_REQ
//! - \ref AONWUC_MCU_GBIAS_REQ
//! - \ref AONWUC_OSC_BGAP_REQ
//! - \ref AONWUC_AUX_BGAP_REQ
//! - \ref AONWUC_MCU_BGAP_REQ
//! - \ref AONWUC_GBIAS_ON
//! - \ref AONWUC_BGAP_ON
//! - \ref AONWUC_AUX_POWER_DOWN
//! - \ref AONWUC_MCU_POWER_DOWN
//! - \ref AONWUC_JTAG_POWER_ON
//! - \ref AONWUC_AUX_POWER_ON
//! - \ref AONWUC_MCU_POWER_ON
//! - \ref AONWUC_SPLY_POWER_DOWN
//
//*****************************************************************************
__STATIC_INLINE uint32_t
AONWUCPowerStatus(void)
{
    //
    // Return the power status.
    //
    return (HWREG(AON_WUC_BASE + AON_WUC_O_PWRSTAT));
}

//*****************************************************************************
//
//! \brief Enable shut-down of the device.
//!
//! Use this function to enable shut-down of the device. This will force all I/O values to
//! be latched - possibly enabling I/O wakeup - then all internal power
//! supplies are turned off, effectively putting the device into shut-down mode.
//!
//! \note No action will take place before the CM3 is put to deep sleep.
//!
//! \note The shut-down command is ignored if the JTAG interface has been
//! activated.
//!
//! \return None
//
//*****************************************************************************
__STATIC_INLINE void
AONWUCShutDownEnable(void)
{
    //
    // Ensure the JTAG domain is turned off;
    // otherwise MCU domain can't be turned off.
    //
    HWREG(AON_WUC_BASE + AON_WUC_O_JTAGCFG) = 0;

    //
    // Enable shutdown of the device.
    //
    HWREG(AON_WUC_BASE + AON_WUC_O_CTL0) &= ~AON_WUC_CTL0_PWR_DWN_DIS;
    HWREG(AON_WUC_BASE + AON_WUC_O_SHUTDOWN) = AON_WUC_SHUTDOWN_EN;
}

//*****************************************************************************
//
//! \brief Enable power down mode on AUX and MCU domain.
//!
//! Use this function to enable powerdown on the AUX and MCU domain.
//!
//! \note The powerdown command is ignored if the JTAG interface has been
//! activated.
//!
//! \return None
//
//*****************************************************************************
__STATIC_INLINE void
AONWUCDomainPowerDownEnable(void)
{
    //
    // Ensure the JTAG domain is turned off;
    // otherwise MCU domain can't be turned off.
    //
    HWREG(AON_WUC_BASE + AON_WUC_O_JTAGCFG) = 0;

    //
    // Enable power down mode.
    //
    HWREG(AON_WUC_BASE + AON_WUC_O_CTL0) &= ~AON_WUC_CTL0_PWR_DWN_DIS;
}

//*****************************************************************************
//
//! \brief Use this function to disable power down mode of the MCU and AUX domain.
//!
//! Disabling powerdown on the MCU and/or AUX will put the domains in a
//! virtual power down when requesting to be powered down. Logic is the same
//! but power is kept on.
//!
//! \return None.
//
//*****************************************************************************
__STATIC_INLINE void
AONWUCDomainPowerDownDisable(void)
{
    //
    // Disable power down mode.
    //
    HWREG(AON_WUC_BASE + AON_WUC_O_CTL0) |= AON_WUC_CTL0_PWR_DWN_DIS;
}

//*****************************************************************************
//
//! \brief Use this function to clear specific status bits.
//!
//! Use this function to clear the bits that are set in the AON WUC status
//! register. This register requires a write 1 to clear.
//!
//! AON Wake Up Controller TAP can request a total/full Flash erase. If so,
//! the corresponding status bits will be set in the status register and can
//! be read using AONWUCMcuResetStatus() or cleared using this function. The reset
//! source and type give information about what and how the latest reset
//! was performed. Access to these bits are indentical to the flash erase
//! bits.
//!
//! \param ui32Status defines in a one-hot encoding which bits to clear in the
//! status register. Use OR'ed combinations of the following:
//! - \ref AONWUC_TOTAL_FLASH_ERASE
//! - \ref AONWUC_FULL_FLASH_ERASE
//! - \ref AONWUC_MCU_RESET_SRC
//! - \ref AONWUC_MCU_RESET_TYPE
//!
//! \return None
//
//*****************************************************************************
__STATIC_INLINE void
AONWUCMcuResetClear(uint32_t ui32Status)
{
    //
    // Check the arguments.
    //
    ASSERT((ui32Status & AONWUC_TOTAL_FLASH_ERASE) ||
           (ui32Status & AONWUC_FULL_FLASH_ERASE) ||
           (ui32Status & AONWUC_MCU_RESET_SRC) ||
           (ui32Status & AONWUC_MCU_RESET_TYPE));

    //
    // Clear the status bits.
    //
    HWREG(AON_WUC_BASE + AON_WUC_O_CTL1) = ui32Status;
}

//*****************************************************************************
//
//! \brief Return the reset status.
//!
//! This function returns the value of the AON_WUC_O_CTL1 register.
//!
//! \return Returns the status from the AON WUC.
//
//*****************************************************************************
__STATIC_INLINE uint32_t
AONWUCMcuResetStatus(void)
{
    //
    // Return the current status.
    //
    return (HWREG(AON_WUC_BASE + AON_WUC_O_CTL1));
}

//*****************************************************************************
//
//! \brief Configure the recharge controller.
//!
//! The parameter \c bAdaptEnable is used to enable or disable the adaptive
//! algorithm for the recharge controller.
//! The adaptive algorithm for the recharge controller is defined as
//!
/*!
\verbatim

  New_Period = Period * (1 + (AdaptRate / 1024) )

      AdaptRate
     ----------- = ( 2^(-C1) + 2^(-C2)  )
        1024

